app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "release_date" = '1990-11-25 00:00:00.000000', "updated_at" = '2014-02-27 03:21:02.470700' WHERE "movies"."id" = 1
---
	  def update
		  @movie = Movie.find params[:id]
		  @movie.update_attributes!(params[:movie])